perf/endpoints/accounts.yaml
config:
  environments:
    api:
      target: "http://localhost:5555"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
      payload:
        - path: "../sample_data/balances.csv" # Used for PUT requests
      fields:
        - "balance"
      loadAll: true
      name: balances

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warmup Phase
      duration: 30
      arrivalRate: 2
      rampTo: 10
    
    - name: Load Test
      duration: 60
      arrivalRate: 10 
      rampTo: 300
      
    - name: Plain
      duration: 30
      arrivalRate: 300
    
    - name: Stress Test
      duration: 60 
      arrivalRate: 250 
      rampTo: 1000

scenarios:
  - name: Get Accounts (/accounts)
    flow:
      - get:
          url: "/accounts"

  - name: Update Account Balances (/accounts/{id}/balance)
    flow:
      - loop:
          - put:
              url: "/accounts/{{ $loopElement.id }}/balance"
              json:
                balance: "{{ $loopElement.balance }}"
        over: balances