perf/endpoints/exchange.yaml
config:
  target: "http://localhost:5555"
  plugins:
    statsd:
      host: localhost
      port: 8125
      prefix: "artillery-api"

  payload:
    path: "../sample_data/exchanges.csv"
    fields:
      - baseCurrency
      - counterCurrency
      - baseAmount
      - baseAccountId
      - counterAccountId

  http:
    pool: 50

  phases:
    - name: Warmup Phase
      duration: 30
      arrivalRate: 2
      rampTo: 10

    - name: Load Test
      duration: 60
      arrivalRate: 10
      rampTo: 300

    - name: Plain
      duration: 30
      arrivalRate: 300

    - name: Stress Test
      duration: 60
      arrivalRate: 250
      rampTo: 1000

scenarios:
  - name: Exchange (/exchange)
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "{{ baseCurrency }}"
            counterCurrency: "{{ counterCurrency }}"
            baseAmount: "{{ baseAmount }}"
            baseAccountId: "{{ baseAccountId }}"
            counterAccountId: "{{ counterAccountId }}"