perf/endpoints/rates.yaml
config:
  environments:
    api:
      target: "http://localhost:5555"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
      payload:
        - path: "../sample_data/rates.csv"
      fields:
        - "baseCurrency"
        - "counterCurrency"
        - "rate"
      loadAll: true
      name: rates

  pool: 50

  phases:
    - name: Warmup Phase
      duration: 30
      arrivalRate: 2
      rampTo: 10
    # Load Test Phase: Simulate a steady load of users
    - name: Load Test
      duration: 60 # Test for 1 minute
      arrivalRate: 10 # 10 new virtual users per second
      rampTo: 300 # Ramp up to 300 users (steady state)
    - name: Plain
      duration: 30
      arrivalRate: 300
    # Stress Test Phase: Simulate a high load, increasing the number of users significantly
    - name: Stress Test
      duration: 60 # Test for 1:30 minutes
      arrivalRate: 250 # Start with 25 new users per second
      rampTo: 1000 # Ramp up to 200 users per second

scenarios:
  - name: Get Rates (/rates)
    flow:
      - get:
          url: "/rates"

  - name: Update Rates (/rates)
    flow:
      - loop:
          - put:
              url: "/rates"
              json:
                baseCurrency: "{{ $loopElement.baseCurrency }}"
                counterCurrency: "{{ $loopElement.counterCurrency }}"
                rate: { { $loopElement.rate } }
        over: rates