perf/endpoints/rates.yaml
config:
  environments:
    api:
      target: "http://localhost:5555"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
      payload:
        - path: "../sample_data/rates.csv"
      fields:
        - "baseCurrency"
        - "counterCurrency"
        - "rate"
      loadAll: true
      name: rates

  pool: 50

  phases:
    - name: Warmup Phase
      duration: 30
      arrivalRate: 2
      rampTo: 10
    
    - name: Load Test
      duration: 60 
      arrivalRate: 10 
      rampTo: 300 
      
    - name: Plain
      duration: 30
      arrivalRate: 300
    
    - name: Stress Test
      duration: 60 
      arrivalRate: 250
      rampTo: 1000

scenarios:
  - name: Get Rates (/rates)
    flow:
      - get:
          url: "/rates"

  - name: Update Rates (/rates)
    flow:
      - loop:
          - put:
              url: "/rates"
              json:
                baseCurrency: "{{ $loopElement.baseCurrency }}"
                counterCurrency: "{{ $loopElement.counterCurrency }}"
                rate: { { $loopElement.rate } }
        over: rates